### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_access_policy.adgroup_admin_itn will be created
  + resource "azurerm_key_vault_access_policy" "adgroup_admin_itn" {
      + certificate_permissions = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # azurerm_key_vault_access_policy.adgroup_developers_itn will be created
  + resource "azurerm_key_vault_access_policy" "adgroup_developers_itn" {
      + certificate_permissions = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "32544b2f-b97d-4453-9555-1ad71630512c"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # azurerm_key_vault_access_policy.adgroup_sign_itn will be created
  + resource "azurerm_key_vault_access_policy" "adgroup_sign_itn" {
      + certificate_permissions = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "98d6ed5f-f824-4d18-b1ec-1fdea510ad6d"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # azurerm_key_vault_access_policy.azdevops_platform_iac_policy_itn will be created
  + resource "azurerm_key_vault_access_policy" "azdevops_platform_iac_policy_itn" {
      + certificate_permissions = [
          + "SetIssuers",
          + "DeleteIssuers",
          + "Purge",
          + "List",
          + "Get",
          + "ManageContacts",
        ]
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + object_id               = "60210551-7492-4e02-a89e-0c9eda59bfec"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # azurerm_key_vault_access_policy.infra_cd_itn will be created
  + resource "azurerm_key_vault_access_policy" "infra_cd_itn" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = "19c9e57c-3b95-4cb4-9408-f596f1cc8f8f"
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
        ]
      + tenant_id          = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # azurerm_key_vault_access_policy.infra_ci_itn will be created
  + resource "azurerm_key_vault_access_policy" "infra_ci_itn" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = "8d5d04c7-98f7-4f27-91ae-249231d96918"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.key_vault_itn.azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = false
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-sign-kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "io-p-itn-sign-sec-rg-01"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cosmosdb_account.azurerm_cosmosdb_account.this,
  on .terraform/modules/cosmosdb_account/cosmosdb_account/main.tf line 7, in resource "azurerm_cosmosdb_account" "this":
   7:   enable_free_tier          = var.enable_free_tier

This property has been superseded by `free_tier_enabled` and will be removed
in v4.0 of the AzureRM Provider

(and 30 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)
```

</details>
